<a href="https://colab.research.google.com/github/MeetStark34/MeetStark34/blob/main/Stark.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CLASSWORK I

In [ ]:
import sqlite3
import pandas as pd
# Connect to SQLite (in-memory database for simplicity)
## Connecting to an SQLite in-memory database means creating a temporary database
## that resides in RAM rather than on disk. It’s commonly used for testing

conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

In [ ]:
# Create tables
cursor.execute('''
CREATE TABLE students (
    id INTEGER PRIMARY KEY,
    name TEXT
)
''')

cursor.execute('''
CREATE TABLE science_students (
    id INTEGER PRIMARY KEY,
    name TEXT
)
''')

In [ ]:
# Insert sample data
students_data = [
    (1, 'Alice'),
    (2, 'Bob'),
    (3, 'Charlie'),
    (4, 'David')
]

science_students_data = [
    (2, 'Bob'),
    (3, 'Charlie'),
    (5, 'Eva')
]

In [ ]:
cursor.executemany('INSERT INTO students VALUES (?, ?)', students_data)
cursor.executemany('INSERT INTO science_students VALUES (?, ?)', science_students_data)

In [ ]:
## Display database after creation
# Getting all tables from sqlite_master
sql_query = """SELECT name FROM sqlite_master
    WHERE type='table';"""

cursor.execute(sql_query)
print(cursor.fetchall())

[('students',), ('science_students',)]

In [ ]:
print(pd.read_sql_query("""SELECT name FROM sqlite_master
    WHERE type='table';""", conn))

               name
0          students
1  science_students

In [ ]:
print(pd.read_sql_query('SELECT * FROM students', conn))

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [ ]:
print(pd.read_sql_query('SELECT * FROM science_students', conn))

   id     name
0   2      Bob
1   3  Charlie
2   5      Eva

In [ ]:
conn.close()

# HOMEWORK I

In [ ]:
import sqlite3
import pandas as pd
# Connect to SQLite (in-memory database for simplicity)
## Connecting to an SQLite in-memory database means creating a temporary database
## that resides in RAM rather than on disk. It’s commonly used for testing

conn = sqlite3.connect('exercise.db')
cursor = conn.cursor()

In [ ]:
## Creating the Students Table with Specified Columns
cursor.execute('''
CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    age INTEGER,
    grade TEXT NOT NULL,
    email TEXT UNIQUE
)
''')
conn.commit()

In [ ]:
## Sample Student Records to Insert
students_data = [
    ('Meet', 19, 'A', 'starkmeet@gmail.com'),
    ('Dhruvil', 21, 'A', 'dhruvilsinhrathod24@gmail.com'),
    ('Krishna', 20, 'B', 'krishnabutani7@gmail.com'),
    ('Hil', 19, 'C', 'hilpatel190@gmail.com'),
    ('MeetKumar', 20, 'B', 'meetprajapati2705@gmail.com')
]

# Inserting Data into the Students Table
cursor.executemany('INSERT OR IGNORE INTO students (name, age, grade, email) VALUES (?, ?, ?, ?)', students_data)
conn.commit()

In [ ]:
## Retriving All Records from the Students Table
cursor.execute('SELECT * FROM students')
students_records = cursor.fetchall()

## Print Each Record
for record in students_records:
    print(record)

(1, 'Meet', 19, 'A', 'starkmeet@gmail.com')
(2, 'Dhruvil', 21, 'A', 'dhruvilsinhrathod24@gmail.com')
(3, 'Krishna', 20, 'B', 'krishnabutani7@gmail.com')
(4, 'Hil', 19, 'C', 'hilpatel190@gmail.com')
(5, 'MeetKumar', 20, 'B', 'meetprajapati2705@gmail.com')

In [ ]:
## Displaying data in a tabular format using pandas
df = pd.DataFrame(students_records, columns=['ID', 'Name', 'Age', 'Grade', 'Email'])
print(df)

   ID       Name  Age Grade                          Email
0   1       Meet   19     A            starkmeet@gmail.com
1   2    Dhruvil   21     A  dhruvilsinhrathod24@gmail.com
2   3    Krishna   20     B       krishnabutani7@gmail.com
3   4        Hil   19     C          hilpatel190@gmail.com
4   5  MeetKumar   20     B    meetprajapati2705@gmail.com

In [ ]:
# Connect to the database
conn = sqlite3.connect('exercise.db')
cursor = conn.cursor()

# Drop the students table if it exists
cursor.execute("DROP TABLE IF EXISTS students")

# Commit and close connection
conn.commit()
conn.close()

print("The 'students' table has been dropped.")

The 'students' table has been dropped.

In [ ]:
## Closing the Database Connection
conn.close()

# CLASSWORK II

In [ ]:
import sqlite3
import pandas as pd
## Connect to SQLite (in-memory database for simplicity)
## Connecting to an SQLite in-memory database means creating a temporary database
## that resides in RAM rather than on disk. It’s commonly used for testing

conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

In [ ]:
# Create tables
cursor.execute('''
CREATE TABLE students (
    id INTEGER PRIMARY KEY,
    name TEXT
)
''')

cursor.execute('''
CREATE TABLE science_students (
    id INTEGER PRIMARY KEY,
    name TEXT
)
''')

In [ ]:
# Insert sample data
students_data = [
    (1, 'Meet'),
    (2, 'Bob'),
    (3, 'Charlie'),
    (4, 'David')
]

science_students_data = [
    (2, 'Bob'),
    (3, 'Charlie'),
    (5, 'Eva')
]

In [ ]:
cursor.execute("INSERT INTO students (id, name) VALUES (1, 'Alice')")
cursor.execute("INSERT INTO students (id, name) VALUES (2, 'Bob')")
cursor.execute("INSERT INTO students (id, name) VALUES (3, 'Charlie')")
cursor.execute("INSERT INTO students (id, name) VALUES (4, 'David')")

In [ ]:
cursor.execute("INSERT INTO science_students (id, name) VALUES (2, 'Bob')")
cursor.execute("INSERT INTO science_students (id, name) VALUES (3, 'Charlie')")
cursor.execute("INSERT INTO science_students (id, name) VALUES (5, 'Eva')")

In [ ]:
## Display database after creation
# Getting all tables from sqlite_master
sql_query = """SELECT name FROM sqlite_master
    WHERE type='table';"""

cursor.execute(sql_query)
print(cursor.fetchall())

[('students',), ('science_students',)]

In [ ]:
print(pd.read_sql_query("""SELECT name FROM sqlite_master
    WHERE type='table';""", conn))

               name
0          students
1  science_students

In [ ]:
print(pd.read_sql_query('SELECT * FROM students', conn))

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [ ]:
print(pd.read_sql_query('SELECT * FROM science_students', conn))

   id     name
0   2      Bob
1   3  Charlie
2   5      Eva

In [ ]:
# 2. UNION operation (combine students and science_students without duplicates)
cursor.execute('SELECT name FROM students UNION SELECT name FROM science_students')
print("\nUNION operation - All unique students:")
print(cursor.fetchall())

UNION operation - All unique students:
[('Alice',), ('Bob',), ('Charlie',), ('David',), ('Eva',)]

In [ ]:
# 3. Intersection operation
cursor.execute('SELECT name FROM students INTERSECT SELECT name FROM science_students')
print("\nIntersect operation - common students:")
print(cursor.fetchall())

Intersect operation - common students:
[('Bob',), ('Charlie',)]

In [ ]:
# 4. EXCEPT operation (students in students but not in science_students)
cursor.execute('SELECT name FROM students EXCEPT SELECT name FROM science_students')
print("\nEXCEPT operation - Students not in science_students:")
print(cursor.fetchall())

EXCEPT operation - Students not in science_students:
[('Alice',), ('David',)]

In [ ]:
import sqlite3
import pandas as pd

conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

cursor.execute('create table stu (ID, Name, ShoeSize, Course, IQ )')
conn.commit()

cursor.execute("INSERT INTO stu (ID, Name, ShoeSize, Course, IQ) VALUES (1234567890, 'John Smith', 38, 'Physics', 46)")
cursor.execute("INSERT INTO stu (ID, Name, ShoeSize, Course, IQ) VALUES (1234567891, 'Jim Morrison', 41, 'Chemistry', 56)")
cursor.execute("INSERT INTO stu (ID, Name, ShoeSize, Course, IQ) VALUES (1234567892, 'Leonel Messi', 40, 'Maths', 64)")
cursor.execute("INSERT INTO stu (ID, Name, ShoeSize, Course, IQ) VALUES (1234567893, 'Alan Donald', 37, 'Biology', 70)")
cursor.execute("INSERT INTO stu (ID, Name, ShoeSize, Course, IQ) VALUES  (1234567894, 'David Gill', 46, 'Computer', 81)")

conn.commit()

# Display table contents using Pandas
print(pd.read_sql_query("SELECT * FROM stu", conn))

           ID          Name  ShoeSize     Course  IQ
0  1234567890    John Smith        38    Physics  46
1  1234567891  Jim Morrison        41  Chemistry  56
2  1234567892  Leonel Messi        40      Maths  64
3  1234567893   Alan Donald        37    Biology  70
4  1234567894    David Gill        46   Computer  81

In [ ]:
conn.execute("DELETE from stu where IQ=56")

# display row by row
print(pd.read_sql_query('SELECT * FROM stu', conn))

           ID          Name  ShoeSize    Course  IQ
0  1234567890    John Smith        38   Physics  46
1  1234567892  Leonel Messi        40     Maths  64
2  1234567893   Alan Donald        37   Biology  70
3  1234567894    David Gill        46  Computer  81

In [ ]:
conn.execute('''
UPDATE stu
SET IQ = 100
WHERE name = 'David Gill'
''')

In [ ]:
print(pd.read_sql_query('SELECT * FROM stu', conn))

           ID          Name  ShoeSize    Course   IQ
0  1234567890    John Smith        38   Physics   46
1  1234567892  Leonel Messi        40     Maths   64
2  1234567893   Alan Donald        37   Biology   70
3  1234567894    David Gill        46  Computer  100

In [ ]:
renameTable = "ALTER TABLE stu RENAME TO PGEStudents"
conn.execute(renameTable)

In [ ]:
print(pd.read_sql_query("""SELECT name FROM sqlite_master
    WHERE type='table';""", conn))

          name
0  PGEStudents

# CLASSWORK III

In [ ]:
import sqlite3

# Connect to the SQLite database (or create it if it doesn't exist)
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# Create the employees table
cursor.execute('''
    CREATE TABLE IF NOT EXISTS employees (
        id INTEGER PRIMARY KEY,
        name TEXT,
        department TEXT,
        salary REAL
    )
''')

cursor.execute("INSERT INTO employees (name, department, salary) VALUES ('Meet Stark', 'Sales', 90000)")
cursor.execute("INSERT INTO employees (name, department, salary) VALUES ('Dev Godhani', 'IT', 75000)")
cursor.execute("INSERT INTO employees (name, department, salary) VALUES ('Mike Brown', 'HR', 90000)")
cursor.execute("INSERT INTO employees (name, department, salary) VALUES ('Emily White', 'Sales', 800000)")
cursor.execute("INSERT INTO employees (name, department, salary) VALUES ('Chris Green', 'Finance', 850000)")

# Commit the transaction
conn.commit()

In [ ]:
import pandas as pd
print(pd.read_sql_query("SELECT * FROM employees", conn))

   id         name department    salary
0   1   Meet Stark      Sales  900000.0
1   2  Dev Godhani         IT  750000.0
2   3   Mike Brown         HR   90000.0
3   4  Emily White      Sales  800000.0
4   5  Chris Green    Finance  850000.0

In [ ]:
import sqlite3

# Connect to the SQLite database (or create it if it doesn't exist)
conn = sqlite3.connect(":memory:")  # Using in-memory database for demonstration
cursor = conn.cursor()

# Create Employees table
cursor.execute("""
CREATE TABLE Employees (
    EmployeeID INTEGER PRIMARY KEY,
    Name TEXT,
    DepartmentID INTEGER,
    Salary INTEGER
)
""")

# Create Departments table
cursor.execute("""
CREATE TABLE Departments (
    DepartmentID INTEGER PRIMARY KEY,
    DepartmentName TEXT
)
""")

# Insert sample data into Employees

cursor.execute("INSERT INTO Employees (EmployeeID, Name, DepartmentID, Salary) VALUES (1, 'John', 1, 50000)")
cursor.execute("INSERT INTO Employees (EmployeeID, Name, DepartmentID, Salary) VALUES (2, 'Sarah', 2, 60000)")
cursor.execute("INSERT INTO Employees (EmployeeID, Name, DepartmentID, Salary) VALUES (3, 'Michael', 1, 80000)")
cursor.execute("INSERT INTO Employees (EmployeeID, Name, DepartmentID, Salary) VALUES (4, 'Lisa', 3, 55000)")
cursor.execute("INSERT INTO Employees (EmployeeID, Name, DepartmentID, Salary) VALUES (5, 'Daniel', 1, 70000)")

# Insert sample data into Departments

cursor.execute("INSERT INTO Departments (DepartmentID, DepartmentName) VALUES (1, 'IT')")
cursor.execute("INSERT INTO Departments (DepartmentID, DepartmentName) VALUES (2, 'HR')")
cursor.execute("INSERT INTO Departments (DepartmentID, DepartmentName) VALUES (3, 'Finance')")

# Commit the changes
conn.commit()

In [ ]:
print(pd.read_sql_query("SELECT * FROM Employees", conn))

   EmployeeID     Name  DepartmentID  Salary
0           1     John             1   50000
1           2    Sarah             2   60000
2           3  Michael             1   80000
3           4     Lisa             3   55000
4           5   Daniel             1   70000

In [ ]:
print(pd.read_sql_query("SELECT * FROM Departments", conn))

   DepartmentID DepartmentName
0             1             IT
1             2             HR
2             3        Finance